In [1]:
import pandas as pd
path=r"C:\Users\AYOADE\Desktop\data.xlsx"
data=pd.read_excel(path)

In [2]:
print(data)

    Gender  Age Date of birth    Education            Dept  BasePay (1000's)  \
0   Female    1    2004-08-08      College      Operations            42.363
1     Male   21    2002-02-17      College      Management           108.476
2   Female   19    2003-01-07          PhD  Administration            90.208
3     Male   20    2002-02-23      Masters           Sales           108.080
4     Male   26    1996-03-08      Masters     Engineering            99.464
5   Female   20    2003-01-01          PhD      Operations            70.890
6   Female   20    2003-03-23      College           Sales            67.585
7     Male   18    2004-02-15          PhD     Engineering            97.523
8   Female   33    1990-07-01  High School     Engineering           112.976
9   Female   35    1988-05-30      College     Engineering           106.524
10    Male   24    1999-07-30          PhD     Engineering           102.261
11  Female   18    2004-11-02      College      Management            62.759
12  Female   19    2003-10-01      College           Sales            84.007
13  Female   30    1993-03-03      Masters  Administration            86.220
14  Female   35    1988-01-01          PhD      Operations            95.584
15  Female   27    1995-03-23          PhD      Management            73.357
16  Female   23    2000-12-26          PhD  Administration            88.422
17  Female   24    1999-09-08      College  Administration            99.545
18    Male   21    2002-05-05  High School     Engineering            90.386

    Executive  Bonus Percentage Active        Performance  Unnamed: 10  \
0           0             0.100   True       Satisfactory          NaN
1           1             0.020   True               Poor          NaN
2           1             0.030   True       Satisfactory          NaN
3           0             0.070  False        Outstanding          NaN
4           1             0.030   True       Satisfactory          NaN
5           0             0.020   True     Unsatisfactory          NaN
6           0             0.120   True  Very satisfactory          NaN
7           1             0.110   True       Satisfactory          NaN
8           1             0.070   True        Outstanding          NaN
9           1             0.030  False     Unsatisfactory          NaN
10          1             0.010   True  Very satisfactory          NaN
11          0             0.110   True        Outstanding          NaN
12          0             0.040   True  Very satisfactory          NaN
13          1             0.050   True       Satisfactory          NaN
14          0             0.050   True               Poor          NaN
15          0             0.070   True        Outstanding          NaN
16          1             0.030   True        Outstanding          NaN
17          1             0.015   True  Very satisfactory          NaN
18          1             0.040  FASLE       Satisfactory          NaN

    Basepay in1000  BasePay+BonusPercentage  Unnamed: 13        Unnamed: 14  \
0            42363                46599.300          NaN                NaN
1           108476               110645.520          NaN             COUNTA
2            90208                92914.240          NaN              COUNT
3           108080               115645.600          NaN        AVERAGE AGE
4            99464               102447.920          NaN      TOTAL BASEPAY
5            70890                72307.800          NaN     AVERAGE BASE.P
6            67585                75695.200          NaN      MEDIAN BASE.P
7            97523               108250.530          NaN         MIN BASE,P
8           112976               120884.320          NaN         MAX BASE.P
9           106524               109719.720          NaN        NO of Male
10          102261               103283.610          NaN       NO of Female
11           62759                69662.490          NaN  Gender Ratio(F/M)
12           84007                87367.280          NaN                 GR
13           86220                90531.000          NaN                NaN
14           95584               100363.200          NaN                NaN
15           73357                78491.990          NaN                NaN
16           88422                91074.660          NaN                NaN
17           99545               101038.175          NaN                NaN
18           90386                94001.440          NaN                NaN

   Unnamed: 15        Unnamed: 16  Unnamed: 17
0          NaN                NaN          NaN
1           19                NaN          NaN
2           19                NaN          NaN
3    22.842105                NaN          NaN
4      1686.63  TotalBP in 1000's    1686630.0
5        88.77                NaN          NaN
6       90.386                NaN          NaN
7       42.363                NaN          NaN
8      112.976                NaN          NaN
9            6                NaN          NaN
10          13                NaN          NaN
11    2.166667           2.166667          NaN
12    13:06:00                NaN          NaN
13         NaN                NaN          NaN
14         NaN                NaN          NaN
15         NaN                NaN          NaN
16         NaN                NaN          NaN
17         NaN                NaN          NaN
18         NaN                NaN          NaN

In [3]:
data.shape

(19, 18)

In [4]:
data.columns

Index(['Gender', 'Age', 'Date of birth', 'Education', 'Dept',
       'BasePay (1000's)', 'Executive', 'Bonus Percentage', 'Active',
       'Performance', 'Unnamed: 10', 'Basepay in1000',
       'BasePay+BonusPercentage', 'Unnamed: 13', 'Unnamed: 14', 'Unnamed: 15',
       'Unnamed: 16', 'Unnamed: 17'],
      dtype='object')

In [5]:
X=['Date of birth','BasePay+BonusPercentage','Unnamed: 17']

In [6]:
data.drop(X,axis=1,inplace=True)

In [7]:
data.sample(4)

,Gender,Age,Education,Dept,BasePay (1000's),Executive,Bonus Percentage,Active,Performance,Unnamed: 10,Basepay in1000,Unnamed: 13,Unnamed: 14,Unnamed: 15,Unnamed: 16
10,Male,24,PhD,Engineering,102.261,1,0.01,True,Very satisfactory,NaN,102261,NaN,NO of Female,13,NaN
0,Female,1,College,Operations,42.363,0,0.10,True,Satisfactory,NaN,42363,NaN,NaN,NaN,NaN
4,Male,26,Masters,Engineering,99.464,1,0.03,True,Satisfactory,NaN,99464,NaN,TOTAL BASEPAY,1686.63,TotalBP in 1000's
15,Female,27,PhD,Management,73.357,0,0.07,True,Outstanding,NaN,73357,NaN,NaN,NaN,NaN

In [8]:
data.shape

(19, 15)

In [9]:
data.isna().sum()

Gender               0
Age                  0
Education            0
Dept                 0
BasePay (1000's)     0
Executive            0
Bonus Percentage     0
Active               0
Performance          0
Unnamed: 10         19
Basepay in1000       0
Unnamed: 13         19
Unnamed: 14          7
Unnamed: 15          7
Unnamed: 16         17
dtype: int64

In [10]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 19 entries, 0 to 18
Data columns (total 15 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Gender            19 non-null     object
 1   Age               19 non-null     int64
 2   Education         19 non-null     object
 3   Dept              19 non-null     object
 4   BasePay (1000's)  19 non-null     float64
 5   Executive         19 non-null     int64
 6   Bonus Percentage  19 non-null     float64
 7   Active            19 non-null     object
 8   Performance       19 non-null     object
 9   Unnamed: 10       0 non-null      float64
 10  Basepay in1000    19 non-null     int64
 11  Unnamed: 13       0 non-null      float64
 12  Unnamed: 14       12 non-null     object
 13  Unnamed: 15       12 non-null     object
 14  Unnamed: 16       2 non-null      object
dtypes: float64(4), int64(3), object(8)
memory usage: 2.4+ KB

In [11]:
data.fillna(method = 'ffill',inplace=True)

C:\Users\AYOADE\AppData\Local\Temp\ipykernel_5204\2804309081.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  data.fillna(method = 'ffill',inplace=True)

In [12]:
data.isna().sum()

Gender               0
Age                  0
Education            0
Dept                 0
BasePay (1000's)     0
Executive            0
Bonus Percentage     0
Active               0
Performance          0
Unnamed: 10         19
Basepay in1000       0
Unnamed: 13         19
Unnamed: 14          1
Unnamed: 15          1
Unnamed: 16          4
dtype: int64

In [13]:
data.fillna(method = 'bfill',inplace=True)

C:\Users\AYOADE\AppData\Local\Temp\ipykernel_5204\376578928.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  data.fillna(method = 'bfill',inplace=True)

In [14]:
data.sample(2)

,Gender,Age,Education,Dept,BasePay (1000's),Executive,Bonus Percentage,Active,Performance,Unnamed: 10,Basepay in1000,Unnamed: 13,Unnamed: 14,Unnamed: 15,Unnamed: 16
7,Male,18,PhD,Engineering,97.523,1,0.11,True,Satisfactory,NaN,97523,NaN,"MIN BASE,P",42.363,TotalBP in 1000's
8,Female,33,High School,Engineering,112.976,1,0.07,True,Outstanding,NaN,112976,NaN,MAX BASE.P,112.976,TotalBP in 1000's

In [15]:
data.isna().sum()

Gender               0
Age                  0
Education            0
Dept                 0
BasePay (1000's)     0
Executive            0
Bonus Percentage     0
Active               0
Performance          0
Unnamed: 10         19
Basepay in1000       0
Unnamed: 13         19
Unnamed: 14          0
Unnamed: 15          0
Unnamed: 16          0
dtype: int64

In [16]:
data.Gender

0     Female
1       Male
2     Female
3       Male
4       Male
5     Female
6     Female
7       Male
8     Female
9     Female
10      Male
11    Female
12    Female
13    Female
14    Female
15    Female
16    Female
17    Female
18      Male
Name: Gender, dtype: object

In [17]:
data.Gender.value_counts()

Gender
Female    13
Male       6
Name: count, dtype: int64

In [20]:
X=['Unnamed: 10','Unnamed: 13']

In [21]:
data.drop(X,axis=1,inplace=True)

In [22]:
data.sample(4)

,Gender,Age,Education,Dept,BasePay (1000's),Executive,Bonus Percentage,Active,Performance,Basepay in1000,Unnamed: 14,Unnamed: 15,Unnamed: 16
16,Female,23,PhD,Administration,88.422,1,0.030,True,Outstanding,88422,GR,13:06:00,2.166667
5,Female,20,PhD,Operations,70.890,0,0.020,True,Unsatisfactory,70890,AVERAGE BASE.P,88.77,TotalBP in 1000's
17,Female,24,College,Administration,99.545,1,0.015,True,Very satisfactory,99545,GR,13:06:00,2.166667
18,Male,21,High School,Engineering,90.386,1,0.040,FASLE,Satisfactory,90386,GR,13:06:00,2.166667

In [23]:
data.shape

(19, 13)

In [24]:
data.isna().sum()

Gender              0
Age                 0
Education           0
Dept                0
BasePay (1000's)    0
Executive           0
Bonus Percentage    0
Active              0
Performance         0
Basepay in1000      0
Unnamed: 14         0
Unnamed: 15         0
Unnamed: 16         0
dtype: int64

In [27]:
data.rename(columns={"Unnamed: 14":"Rough"},inplace=True)

In [28]:
data.head(2)

,Gender,Age,Education,Dept,BasePay (1000's),Executive,Bonus Percentage,Active,Performance,Basepay in1000,Rough,Unnamed: 15,Unnamed: 16
0,Female,1,College,Operations,42.363,0,0.10,True,Satisfactory,42363,COUNTA,19,TotalBP in 1000's
1,Male,21,College,Management,108.476,1,0.02,True,Poor,108476,COUNTA,19,TotalBP in 1000's

In [29]:
data.sample(5)

,Gender,Age,Education,Dept,BasePay (1000's),Executive,Bonus Percentage,Active,Performance,Basepay in1000,Rough,Unnamed: 15,Unnamed: 16
15,Female,27,PhD,Management,73.357,0,0.07,True,Outstanding,73357,GR,13:06:00,2.166667
4,Male,26,Masters,Engineering,99.464,1,0.03,True,Satisfactory,99464,TOTAL BASEPAY,1686.63,TotalBP in 1000's
9,Female,35,College,Engineering,106.524,1,0.03,False,Unsatisfactory,106524,NO of Male,6,TotalBP in 1000's
8,Female,33,High School,Engineering,112.976,1,0.07,True,Outstanding,112976,MAX BASE.P,112.976,TotalBP in 1000's
3,Male,20,Masters,Sales,108.080,0,0.07,False,Outstanding,108080,AVERAGE AGE,22.842105,TotalBP in 1000's

In [38]:
data.Age

0      1
1     21
2     19
3     20
4     26
5     20
6     20
7     18
8     33
9     35
10    24
11    18
12    19
13    30
14    35
15    27
16    23
17    24
18    21
Name: Age, dtype: int64